我已经知道我之后的任何联系的尝试都极有可能把你越推越远了——我喜欢了你七年，我了解你。

但是还是在写这篇东西。因为，我想让你知道我大概对自己犯的错误有了哪些新的认识。经过这么多天时间，我能冷静下来慢慢思考很多问题。另一方面，我也很久没有给你写信了。这封信也许是我为你写的最后一封信。

这几天是我这辈子最难熬的几天，毫无疑问。我几乎一刻不停地在想，发生了什么，为什么发生，我到底该怎么办。

一开始我觉得——就像你和我分手的那天晚上觉得的——就是你说的，不喜欢我了，单纯地想甩掉我，想获得自由。

可是这种思路始终蕴含着某种无法解决的矛盾。我能意识到，但是却解读不了。你的语气完完全全就是受害者，可是在我指责你装受害者的时候，你却说你没有在装受害者。当时的我理解这是因为你要的只是分手这个结果，所以其他说法都是分手的借口。

但是冷静下来，这样想不对头，始终不对头。

那天的我看着你的语气，满脑子读出的都是挑衅，但是到了后来，我只能看出失望。

不知道你约我出去，是不是一开始就打算和我分手。也许不是，也许一开始就是但是并不是这么坚定。但是我看到了自己的聊天记录，发觉其实你至少直到那时，对我还抱有期望吧。

你说，就是想讨论问题。有很多很多问题想要问我。就是想当面聊。

我回答的是什么呢？

<b>聊啥？</b>
<b>聊孩子跟谁？</b>
<b>不用问了，跟你。</b>

——然后下一句话接着说自己挑手机的事情。

很可笑吧，我大概是这辈子第一次感知到了这种问题的存在。我大概是这辈子第一次意识到这样做是有问题的。但是，这明明简直是——放在情侣关系当中——不可理喻。

这几天，三个月以来的一幕幕总是像放电影一样在我脑海里回放，一遍又一遍。家里的每一样东西都和你有联系，总能以各种七拐八绕的方式让我想起你。但是我终于开始拒绝单纯去想那些好的东西，而是真正地像个男子汉一样面对自己的糟糕之处。

我想起你说不喜欢我骂人，可是我因为奇怪的言论生气的时候却总还是会骂，把你当成透明的垃圾桶。这时候你甚至不能反驳我，因为我只会毫不犹豫地反驳回去，忽略你的感受。

我想起跟你长篇大论为什么口红涂太浓了不好看才是正常的。可是那个妆是你为了我而化的，是你专门把照片发给我的。我明明应该做的是夸你本来就好看，化什么妆都好看。我明明可以说出这样的话——例如现在。是啊，我当然真的觉得你好看。对我来说你明明是世界上最好看的人。你其实当然也知道这一点，可是到了这种时候，我的重点却完全放在什么化妆的初衷之类的屁话上，我的执念却完全放在证明我不喜欢太浓的口红的合理性上，说了一大堆，却根本舍不得说哪怕一句赞美的话。我以为只要我是喜欢你的那个人，就可以把你对我的喜欢的认知当成理所当然的事情。

说到这个，说起来好笑，我发现你没有删除QQ的时候，我知道我基本上只能说一句话，我当时选择了“我爱你”。在我看来这个事实最简单有力。

可是问题是，你难道不知道我爱你吗？

七年了，你当然知道我爱你。但是，爱只是最基本的东西。我的问题就是，我以为只要爱你，一切都迎刃而解，我的缺点会在你面前自动隐形。可是更重要的明明是爱的方式。你选择离开我，是因为我爱你的方式让你根本感觉不到爱。我爱你的方式幼稚，并且本质上以我自己为中心。

我总能向你用一万种方法说明为什么星座很扯淡，并且反驳你的观点，却忽略了你的“反驳”其实只是在试探我能不能包容你。我执拗地要把反驳重新反驳回去，然后再虚伪地告诉你“我会包容你”，可是这毫无疑问还是不能弥补这种毫无必要的辩论带来的怀疑感。

在你试探我的包容性的时候，我总是说正常人<b>不应该</b>相信星座。

你因为感受不到我的宽容，说我喜欢你是因为习惯的时候，我很生气地说，这都是多少年前的言论了，你<b>不应该</b>这么说；

你和我说了一万遍，让我不要总是说“你都不要我了”的那种话。我的反应永远是什么样的呢？我的反应永远是——我这么说是因为我没有安全感，你<b>不应该</b>误会；

打电话的时候你说你开始觉得我不靠谱。我的反应是，“靠谱的人都是傻子”“我在编程上非常上进，你<b>不应该</b>说我不靠谱”。

是啊，我眼睛里能看到的永远只是你不应该这样，不应该那样。仿佛只有我的需求是需求，你的需求就总是有某种方法论证成“不应该”，仿佛我的需求天然地就是恰当的需求，你的需求就需要经历严格的论证。

可重点难道不应该是，你<b>需要</b>我这么做吗？

“谈恋爱就是两个人互相妥协的过程。”——我说得头头是道。但是在平时，说这话的我永远舍不得妥协一星半点。我总是喜欢说，我否定你的需求依据的是逻辑——这话倒是对了一半，可是，我好像从来舍不得用同样一份我引以为豪的“逻辑”来质疑我自己的需求。事实就是，我几乎根本不会怀疑自己。我上一次这样做恰恰是刚和你在一起的时候。我说我要体谅你，因为你要从我这里学会爱人，我还为此把你的备注改成了“[学员]熊熊”。

那我接下来的三个月一定是做了一个糟糕的老师吧。

你不会用一大堆所谓的“正确/错误”的机械叙事来要求我，我却不断地根据自己的需要这样对你。实质上，我就是在不断地欺负你罢了。

即使是那一天删除我的最后一刻，我还是在想办法证明，一切都只是你的“误会”。就好像世界上从来从来就不可能存在这种可能性——那就是我真的完完全全做错了。

但是的确是这样的。

<br>

我会想到这些很大程度上是因为我妈妈。很奇妙的一件事是，我终于把这件事和妈妈说了。所有，从头到尾。我从小到大从来不敢这样做，因为我总是设想出她最后会反过来骂我。

可是，妈妈看着哭得很伤心的我说，我应该先放一放，先让你也考虑几天，同时要学会换位思考。她甚至没有像我猜的一样劝我说之后会有更好的。她其实早就知道一些事情。她大概也知道这个女孩子一直以来对我有多重要。所以她也在帮我想办法。

这就是我换位思考了这些天的结果。事实上，你近来能感受到的只会是：我关注的点永远不在你身上。对你来说，我毫无疑问只在乎我那狭隘得可怜的目光所能覆盖到的所谓“正确结论”，比起你，我好像更加热衷于说服你。你两天没有怎么说话，我只是出于你不理我的疑惑才问了几句。没有关心，没有追问，仿佛没有你我也可以活得好好的。

熊熊，不是这样的。真的不是这样的。对不起。

就像我说的一样。我们异口同声说的“一开始的开心”，说明我明明有能力不做这样的人。

因为我在记录里看到。

和你在一起的第三分钟，你说我“说话的语气都变了”，而我还在掐自己，担心一切都是一场梦；

和你在一起的第二天，我说，我都不敢和你卖萌了，不敢和你耍贱了。因为我好担心你一不高兴就又离开我了；

和你在一起的第一周，我第无数次说，我还没搞懂发生了什么，我还不敢相信发生了什么。

所以这就是问题吧。这就是最根本的问题。

<b>我逐渐忘记了一开始对你的那种珍惜。</b>

我一开始会经常夸你，会经常关心你的生活，说话之前会考虑，也会过自己的脑子。那时的我不会把负能量一股脑地倾泻给你，不会把不如意的事情又抛给你。男朋友应该做的，不应该是挡在这些乱七八糟的东西前面吗？可是之后的我却好像已经不打算承担这样的责任。

而你却根本没有办法抗议——因为我的道理就是，“我抱怨的是政府啊。没有怪你”。

短短三个月，我把拥有彼此当成一件理所当然的事情。我先把回复当成一件理所当然的事情，但是从来没有人说谈恋爱就一定要每天都回消息。我又把同等的表达当成一件理所当然的事情，但是我一边用自己的喜欢来要求你，一边却对你的关心和需要麻木不仁。我明明可以说“我好想和你玩游戏”，可是却非要用“你都不和我玩游戏”这种指责的语气。而你一旦不舒服，我却会说这只是“事实”，并且无理地坚持这是某种“卖萌”——可你明明说了不喜欢这样了，我凭什么继续觉得这是一种卖萌。根本没有那么多大道理，我只是任性而自私而已。

你可能确实没有多喜欢我。但是让你更加喜欢我，明明是我的责任，而不是你的责任。如果我能维持那种珍惜，你并不会陷入这么频繁的自我怀疑。你的负面情绪和怀疑、纠结，归根到底都是我一手造成的。但是我又总是反过来拿这些怀疑当作进一步怀疑你的依据。我过去老喜欢说当初你不答应我是逻辑闭环，但是这才是真正无解的逻辑闭环。在这个闭环里面，你的无助和抗议无处释放，只能在我集中隔离时一而再、再而三地倾泻负面情绪时急剧恶化，然后最后在那一天爆发。我的迟钝和忽略，就是这种发展的罪魁祸首。

我在控制自己的方面做得一塌糊涂。在忘记了珍惜你之后，我用过去谈恋爱的经验来要求你，但是对自己没有提任何要求——我想说什么话，就始终会说什么话；我想做什么事，就始终会做什么事。要改变的好像永远是你，永远不可能是我。哪怕是这样，在你质疑我永远正确的时候，我说的是，“那是因为你能看到AB，我能看到ABCD，即使真相可能是ABCDEFG”。

这样的话看起来明明就像我觉得自己高你一等一样。

那天我总是说，你没有告诉我有这种问题，严重到要分手的地步，然后一上来就说分手。现在想起来，其实很可笑。这些天，我回想起集中隔离时太多太多的事情，都是一个个赤裸裸的信号，可是迟钝的关之浩，忘记珍惜熊熊的关之浩，根本一点都没有接收到。而隔离期的无事可做，更是变相让我有更多机会变本加厉地在这些方面对你进行无声的霸凌。

更可笑的是，那天我还指责你为什么不先和我讨论——我压根没有把之前这些被我直接驳回的抗议当成你发起讨论的尝试。

正是因为以上的一切，终于在那一天，熊熊问了。

“我们在干什么啊？”

我知道，到了这个部分，你可能就不愿意看了。你可能还是会觉得，我“忏悔”了这一大堆，唯一目的是挽回你。

不是这样的，熊熊。挽回你是我希望的结果，但是我主要想做的是告诉你，我长大了。这不是我第一次和你说我长大了，并且将来我也还会有继续成长的空间。但是希望你能真的感受到这一次我的变化。

我和妈妈说了很多，她也为我提供了很多新的角度。我觉得自己明白了很多之前根本不屑于或者是不敢细想的道理，也看到了自己作为一个男朋友的糟糕之处。我总是热衷于把别人分析得头头是道，却没有胆量把自己当作别人来进行剖析。这一次算是一个契机。

我一直以来最佩服的一个知乎答主，最近很频繁地回答有关某个事件的问题，他的想法和大多数人都不太一样。但是事实证明，这回他的观点大约终于是错了。

这个之前的我以为能永远保持绝对正确的人终于还是错了。

在今天，他的回答下面，有一条评论戳中了我。

那条评论写的是：

“不同价值观模型的人在相同的输入下会得到不同的结果。而这个模型是用个人成长经历喂出来的。

看了你最近的回答，你似乎认为别人的看法与你不同是因为别人能力不行，但其实只是别人与你有不同的经历罢了。”

这段批评我关注并佩服的人的话，也能完美地批评到我头上来。

我只是对某些东西的兴趣更高，却自大到觉得可以凌驾于别人的选择和需求之上。

我一直说自己是普通人，但是却总是故意忽略别人也是普通人这件事实。

我自觉自己的同理心和包容能力好像在短短几天之内就从5岁变成了20岁——也就是同龄人的平均水平（笑）。这也可以算是熊熊决定离开之后的数天来，我收获的最大的礼物吧。

但是除了告诉熊熊我的收获，我的目的当然还是想挽回。只不过，这一回不是之前那样，因为单纯离不开你、单纯不能放手的挽回，也不是“再给我一次机会”之类的废话。不是那样的苦情剧本。

这一回，我只是想提供一种可能性。一种和更好的关之浩重新开始的可能性。
<br><br>

因为关之浩成长了。

因为关之浩真的能想通自己为什么不是绝对正确了。

（而不是通过那堆什么ABCDEFG的比喻）

因为关之浩现在有能力承担起做一个男朋友（而不是女朋友）的责任。

因为关之浩能重新拾起对熊熊的珍惜，并且不会再丢掉。

我爱你，但这不再构成我挽回你的原因。我挽回你的原因是，我认为自己学会了用更好的方式来爱你。

也正是由于这样的原因，你的决定对我来说已经不是那样地重要。重要的只是你知道了这些天以来我的改变。重要的只是我向你提供的这种可能性始终存在着，于是在将来的某一天，你可能会想起我，也许我们还可以重新开始。即使这种重新开始是试探性的，或者是有条件的。

我很抱歉，这种改变应该早一点来到。但凡我的嗅觉灵敏一些，但凡我少一点固执己见和自以为是，我们就根本不会走到现在这一步。

总而言之，希望过去的三个月给你带来的不全是痛苦的回忆。再次说一遍，对不起。

如果你愿意，至少，或许我们可以继续当普通朋友。

这个将来可能会很漫长，甚至可能永远也不会到来，但是我就呆在这里，哪也不去，也哪都去不了。



<p style="text-align:right">关之浩</p>
<p style="text-align:right">2020年8月</p>